import React, { useState } from "react";
import Icon from "react-icons-kit";
import {ic_keyboard_arrow_up} from 'react-icons-kit/md/ic_keyboard_arrow_up'
import {ic_headset_mic} from 'react-icons-kit/md/ic_headset_mic'
import logo from "../../Media/footerlogo2.png"
import {ic_keyboard_arrow_down_outline} from 'react-icons-kit/md/ic_keyboard_arrow_down_outline'
const FooterRes = () => {
  const [activeIndex, setActiveIndex] = useState(null);
  const [isExpanded, setIsExpanded] = useState(false);
  const toggleAccordion = (index) => {
    setActiveIndex((prevIndex) => (prevIndex === index ? null : index));
  };
  const handleScrollToTop = () => {
    const scrollTop = document.querySelector(".scroll_top");
    scrollTop.addEventListener("click",()=>{
        window.scrollTo({
            top: 0,
            behavior: 'smooth'
        });
     })
    
    };
  const accordionData = [
    {
      title: " با دیجی کالا",
      content: [
        "بلاگ",
        "خرید گوشی",
        "گوشی آیفون",
        "گوشی سامسونگ",
        "گوشی شیائومی",
        "گوشی پوکو",
        "مقایسه گوشی",
        "قیمت لپ‌تاپ",
        "هندزفری بلوتوثی",
        "لپ‌تاپ ایسوس",
      ],
    },
    {
      title: "  خدمات مشتریان",
      content: [
        "بلاگ",
        "خرید گوشی",
        "گوشی آیفون",
        "گوشی سامسونگ",
        "گوشی شیائومی",
        "گوشی پوکو",
        "مقایسه گوشی",
        "قیمت لپ‌تاپ",
        "هندزفری بلوتوثی",
        "لپ‌تاپ ایسوس",
      ],
    },
    {
      title: " راهنمای خرید از دیجی کالا",
      content: [
        "بلاگ",
        "خرید گوشی",
        "گوشی آیفون",
        "گوشی سامسونگ",
        "گوشی شیائومی",
        "گوشی پوکو",
        "مقایسه گوشی",
      ],
    },
     {
      title: " شرکت تجاری",
      content: [
        "بلاگ",
        "خرید گوشی",
        "گوشی آیفون",
        "گوشی سامسونگ",
        "گوشی شیائومی",
        "گوشی پوکو",
        "مقایسه گوشی",
      ],
    },
  ];

  return (
    <div className="w-full  p-1 flex flex-col ">
        <div className=" w-[100%] flex flex-row justify-center mx-auto">
            <div onClick={handleScrollToTop} className="scroll_top bg-white w-[43%] p-2  flex items-center justify-center ">
                    <p className="text-center mt-2 text-[12px] text-[#19BFD3]">بازگشت به بالا</p>
                    <Icon icon={ic_keyboard_arrow_up} className="mt-1 text-[#19BFD3]" size={25}/>
            </div>
        </div>
        <div className=" flex flex-row justify-between p-2 w-[100%]">
            <div className="flex flex-row  gap-3">
                <Icon className="mt-2" icon={ic_headset_mic} size={29} />
                <div className="flex flex-col ">
                    <p className="text-[12px]">۷ روز هفته، ۲۴ ساعت</p>
                    <p className="text-[15px]">تماس با پشتیبانی</p>
                </div>
            </div>            
            <div>
                <button className=" px-3 py-2 rounded-md border-[1px] border-black">
                    <p>تماس</p>

                </button>
            </div>
        </div>
        <hr className="mt-3" />
        <div className=" flex flex-row justify-between p-2 w-[100%]">
            <div className="flex flex-row  gap-3">
                <img className="w-[15%]" src={logo} alt="" />
                <div className="flex flex-col gap-2 ">
                    <p className="text-[12px]">۷ روز هفته، ۲۴ ساعت</p>
                    <p className="text-[15px]">تماس با پشتیبانی</p>
                </div>
            </div> 
            <div>
                <button className="bg-[black] px-3 py-2 rounded-md border-[1px] border-black">
                    <p className="text-[white]">دانلود</p>

                </button>
            </div>
        </div>
      {accordionData.map((section, index) => (
        <div
          key={index}
          className=" p-1  "
        >
          <div
            className={`p-1 mt-3 rounded-t-md cursor-pointer flex flex-row justify-between ${
              index === 4 ?  " text-white" : " text-[black]"
            }`}
            onClick={() => toggleAccordion(index)}
          >
            <h3 className="text-right font-semibold text-[13px]">{section.title}</h3>
            <Icon icon={ic_keyboard_arrow_down_outline} size={22} />
          </div>
          <hr className="mt-2" />
          <div
            className={`${
              activeIndex === index ? "block" : "hidden"
            } transition-all duration-300 p-1 flex flex-col gap-3 rounded-b-md text-[13px]  ${
              index === 2 ? " text-[black]" : " text-[black]"
            }`}
          >
            {section.content.map((item, i) => (
              <p key={i}>{item}</p>
            ))}
          </div>
        
        </div>
      ))}

      <div className="p-2 flex flex-col">
        <p className="text-[13px] text-[#626161] font-semibold">فروشگاه اینترنتی دیجی‌کالا، بررسی، انتخاب و خرید آنلاین</p>
            <div
                className={`overflow-hidden transition-all duration-300 mt-2 ${isExpanded ? "max-h-[none]" : "max-h-[80px]"}`}
                style={{ filter: isExpanded ? "blur(0px)" : "blur(1px)" }}
            >
                <p className="text-[10px] text-[#7b7b7b]">
                یک خرید اینترنتی مطمئن، نیازمند فروشگاهی است که بتواند کالاهایی متنوع، باکیفیت و دارای قیمت مناسب را در مدت زمان ی کوتاه به دست مشتریان خود برساند و ضمانت بازگشت کالا هم داشته باشد؛ ویژگی‌هایی که فروشگاه اینترنتی دیجی‌کالا سال‌هاست بر روی آن‌ها کار کرده و توانسته از این طریق مشتریان ثابت خود را داشته باشد.
                                یکی از مهم‌ترین دغدغه‌های کاربران دیجی‌کالا یا هر فروشگاه‌ اینترنتی دیگری، این است که کالای خریداری شده چه زمانی به دستشان می‌رسد. دیجی‌کالا شیوه‌های مختلفی از ارسال را متناسب با فروشنده کالا،‌ مقصد کالا و همچنین نوع کالا در اختیار کاربران خود قرار می‌دهد. هر یک از روش های ارسال دیجی کالا شرایط و ویژگی‌های خاص خود را دارند که ممکن است گاهی برای کاربران جدید، مبهم و پیچیده به نظر برسند. برای آگاهی بیشتر مشتریان از خدمات دیجی‌کالا، این فروشگاه اینترنتی در بخشی از وب‌سایت خود راهنمای کاملی از شیوه‌‌های ارسال را به صورت ساده و به دور از پیچیدگی، قرار داده است که شامل 8 نوع ارسال کالا به روش‌های زیر است: ارسال امروز، دریافت حضوری، دریافت از گنجه، ارسال توسط فروشنده، ارسال عادی، ارسال کالاهای بزرگ، سنگین و فوق سنگین، ارسال سریع سوپرمارکتی، ارسال با پست
    
                                کدام محصولات در دیجی‌کالا قابل سفارش هستند؟
    
                                تقریبا می‌توان گفت محصولی وجود ندارد که دیجی‌کالا برای مشتریان خود در سراسر کشور فراهم نکرده باشد. شما می‌توانید در تمامی روزهای هفته و تمامی شبانه روز دیجی‌کالا که محصولات دارای تخفیف عالی می‌شوند، سفارش خود را به سادگی ثبت کرده و در روز و محدوده زمانی مناسب خود، درب منزل تحویل بگیرید. بعضی از گروه‌های اصلی و زیر مجموعه‌های پرطرفدار محصولات دیجی‌کالا شامل مواردی می‌شود که در ادامه به معرفی آن‌ها می‌پردازیم که امکان ارسال امروز برای آن ها وجود دارد. 
    
                                دیجی کالا در جشنواره‌های سالیانه خود به طور معمول روی تمام دسته بندی‌های کالایی تخفیف‌های عالی قرار‌می‌دهد. به عنوان مثال در زمان بلک فرایدی یا حراج جمعه سیاه، در این سال‌ها بیشترین درصد تخفیف در اختیار مشتریان دیجی‌کالا قرار گرفته‌است و شامل دسته بندی های مختلف از موبایل و لپ تاپ تا عطر و لباس و حتی غذای حیوانات خانگی بوده‌است. 
    
                                کالای دیجیتال
    
                                انواع گوشی موبایل از برندهای مختلفی مثل آیفون،  گوشی سامسونگ، گوشی نوکیا، گوشی شیائومی، گوشی هواوی، و...، انواع کنسول بازی ps4 و ps5، انواع تبلت‌های پرطرفدار مثل تبلت سامسونگ نوت 10، انواع هندزفری مثل هندزفری بی سیم، تلوزیون از برندهای مختلف مثل تلویزیون سامسونگ، سونی و...، انواع مانیتور، کیس، کیبورد، مودم از برندهای مختلف مثل مودم ایرانسل، آنتن و ... تنها بخشی از محصولاتی هستند که زیر مجموعه کالای دیجیتال در دیجی‌کالا قرار دارند.
    
                                خودرو، ابزار و تجهیزات صنعتی
    
                                انواع خودروهای ایرانی و خارجی از برندهای مطرحی مثل هوندا، کیا و...، موتور سیکلت از برندهایی مثل کویر موتور و...، لوازم جانبی خودرو مثل سیستم صوتی تصویر، ضبط و...، لوازم یدکی مثل دیسک و صفحه کلاج و... و لوازم مصرفی خودرو مثل کفپوش سانا در این گروه قرار می‌گیرند.
    
                                مد و پوشاک
    
                                محصولاتی مثل انواع لباس مثل لباس مجلسی زنانه و مردانه، لباس راحتی، لباس ورزشی، اکسسوری، کیف، کفش، عینک آفتابی، لباس زیر، شال و روسری و... جزو مواردی هستند که می‌توانید آن‌ها را از برندهای مطرح ایرانی و خارجی موجود در دیجی کالا مثل آدیداس، نایکی، دبنهامز، آلدو، درسا و... خریداری کنید.
    
                                اسباب بازی کودک و نوزاد
    
                                در این دسته از کالاهای دیجی‌کالا، انواع لوازم بهداشتی و حمام کودک و نوزاد، انواع پوشاک و کفش، تبلت، اسباب‌بازی، لوازم اتاق خواب کودک، لوازم ایمنی، لوازم شخصی و غذا خوری و ... قرار می‌گیرد تا خرید را برای پدر و مادرها به کاری سریع و آسان تبدیل کند.
    
                                کالاهای سوپر مارکتی
    
                                هر چیزی از مواد خوراکی که به آن نیاز دارید، در سوپرمارکت دیجی‌کالا پیدا می‌شود، محصولات پرطرفداری مثل کره بادام‌زمینی، عسل، سس، قهوه، زعفران، شکلات، انواع نان و ... از برندهای معتبر و معروفی مثل نستله، نوتلا، استارباکس، مزمز، چی توز و ... همگی در اختیار شما هستند و تا رسیدن به آشپزخانه شما تنها چند کلیک فاصله دارند.
    
                                زیبایی و سلامت
                                انواع لوازم آرایش مثل لاک، رنگ مو، لوازم آرایش لب، چشم، صورت و... همگی در دیجی‌کالا موجود هستند. همچنین محصولات بهداشتی مثل انواع شامپو، کرم ضد آفتاب، ماسک صورت، ضد تعریق، ماسک مو  و...، انواع لوازم شخصی برقی، ست هدیه، بهترین انواع عطر و اسپری، کرم پودر، ریمل و رژلب وانواع زیورآلات طلا و نقره مثل سرویس طلا، سرویس نقره و... به همراه وسایل مراقبت شخصی طبی در گروه زیبایی و سلامت دیجی‌کالا قرار می‌گیرد. در این بخش برندهای مطرحی مثل اسنس، پنبه ریز، سینره و... حضور دارند.همچنین میتوانید انواع مکمل غذایی و دارویی مثل داروی مناسب سرماخوردگی را در دیجی کالا تهیه کنید.
    
                                خانه و آشپزخانه
    
                                یکی از متنوع‌ترین بخش‌های دیجی‌کالا، بخش لوازم خانه و آشپزخانه است که از محصولاتی مثل صندلی گیمینگ در بخش صندلی‌ها گرفته تا انواع مبل راحتی، انواع آبگرمکن مثل آبگرمکن بوتان، لباسشویی‌های متنوع مثل انواع لباسشویی اسنوا، شیرآلات مختلف مثل شیرآلات قهرمان و...، ظروف و همچنین لوازم برقی آشپزخانه مثل توستر و... را شامل می‌شود و امکان خریدی عالی را برای مشتریان فراهم کرده است. در بخش لوازم خانگی دیجی‌کالا، برندهای معتبری مثل تفال، اخوان، فیلیپس، ال جی، اسنوا، جی پلاس و... حضور دارند.
    
                                کتاب، لوازم تحریر و هنر
    
                                بخش هنر، کتاب، رمان و لوازم تحریر دیجی‌کالا نیز یکی از متنوع‌ترین بخش‌های این فروشگاه اینترنتی است. انواع کتاب و مجله، کتاب زبان، بازی، لوازم تحریر با طرح‌های مختلف مانند دختر کفشدوزکی، سازهایی مثل پیانو، سنتور، هنگ درام  و... با بهترین قیمت‌ها و از بهترین برندها در دسترس شما قرار دارند.
    
                                ورزش و سفر
    
                                هر نوع وسیله و لباس ورزشی که فکرش را کنید، انواع وسایل کمپینگ و کوهنوردی، ساک و قمقمه ورزشی و وسایل سفر اربعین و... در این بخش قرار می‌گیرند. همچنین شما می‌توانید وسایل مد نظر خود را بر اساس نوع ورزش (آبی، هوازی، بدنسازی و...) در دسته‌بندی‌های دیجی‌کالا پیدا کنید.
    
                                محصولات بومی و محلی
    
                                و در آخر دیجی‌کالا از طریق به فروش رساندن محصولات بومی و سنتی متفاوتی مثل انواع خوراکی، گلیم و گبه، ابزار و ... تلاش کرده تا بین هنر ایرانی و متقاضیان آن کوتاه‌ترین راه را پیدا کند. در این بخش شما می‌توانید انواع محصولات از جمله ظروف زیبای مخصوص به سفره هفت‌سین  و پذیرایی از مهمانان در روزهای نوروز، انواع آیینه و شمعدان و هر آن چیزی را که برای خلق زیبایی در روزهای بهاری به آن نیاز دارید، با قیمت مناسب و تنوع بسیار بالا انتخاب کنید. همچنین در صفحه برچسب ها، امکان مشاهده و خرید انواع محصولات با طرح های بومی وجود دارد.  دیجی‌کالا همچنین برای اینکه حال و هوای عید را به اعضای خود هدیه کند، تقویم ۱۴۰۱، انواع ایده عکس پروفایل عید نوروز، آهنگ‌های عید نوروز و موزیک‌های شاد بهاری، وسایل مربوط به خانه‌تکانیی و انواع لباس های عید  را برای شما فراهم کرده است تا بتوانید در کنار خرید خود، از این حال و هوای تازه نهایت لذت را ببرید.           
                </p>
            </div>
            <button onClick={() => setIsExpanded(!isExpanded)} className="flex items-center mt-2">
                <p className="text-[#676868] text-[14px] ">{isExpanded ? " مشاهده کمتر" : "مشاهده بیشتر"}</p>
            </button>
      </div>
    </div>
  );
};

export default FooterRes;
